espressif/esp-idf/examples/ethernet/ptp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESP_NETIF_L2_TAP=y

CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y

CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y

CONFIG_NETUTILS_PTPD_PRIORITY1=246
CONFIG_NETUTILS_PTPD_SERVERPRIO=100
CONFIG_NETUTILS_PTPD_TIMEOUT_MS=10000
CONFIG_NETUTILS_PTPD_SETTIME_THRESHOLD_MS=100
CONFIG_EXAMPLE_PTP_PULSE_GPIO=20
CONFIG_EXAMPLE_PTP_PULSE_WIDTH_NS=250000000
